frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('annkowalska81', 'annkowalska81@gmail.com', '$2y$13$10/Kpg7C1yh3FLSQ.xWB3O2pFM7TXN13OFXvSJ7peOawOMdTMKj.y', '65pFplJGTm-dNSYegg0VuVzXibOFJW8S', 10, 1461912714, 1461912714)
---
    public function signup()
    {

        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        //$user->firstname = $this->firstname;
        //$user->lastname = $this->lastname;
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;